098_Мастер_Ра_разработка/src/Documents/Акт/Акт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Акт</name>
  <basedOn>Document.Счет</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоАктам</registerRecords>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаВБухгалтерию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Копия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Стройка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СметнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/AccumulationRegisters/ВзаиморасчетыПоАктам/ВзаиморасчетыПоАктам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоАктам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/InformationRegisters/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Заказы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыполненияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НадписьНаУпаковке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоризонтальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВертикальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопТребованиеКУпаковке</name>
    <type>
      <types>EnumRef.ДопТребованияКУпаковке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозвратаАкта</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/Documents/Акт/ObjectModule.bsl
// @strict-types


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Организация.Префикс;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Счет") Тогда
		Договор 	= ДанныеЗаполнения.Договор;
		Контрагент 	= ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Отвественный= ДанныеЗаполнения.Отвественный;
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока 			= Товары.Добавить();
			НоваяСтрока.Всего 		= ТекСтрокаТовары.Всего;
			НоваяСтрока.КодЗаказа 	= ТекСтрокаТовары.КодЗаказа.Номер;
			НоваяСтрока.Количество 	= ТекСтрокаТовары.Количество;
			НоваяСтрока.НДС 		= ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма 		= ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаНДС 	= ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыПоАктам.Записывать = Истина;
	
	//Выгрузим		
	тНомер = Номер;
	поискФ = СтрНайти(тНомер,"/");
	Если поискФ>0 Тогда 
		тНомер = СтрЗаменить(Номер,"/","_");
	КонецЕсли;
	
	//Если Организация.ИНН = "667472326758" Тогда
	//	ИмяФайла = "IP\IP_act_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml"; 			
	//ИначеЕсли Организация.ИНН = "6671320017" Тогда 	
	//	ИмяФайла = "RA\RA_act_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml";
	//ИначеЕсли  Организация.ИНН = "6679121870" Тогда 
	//	ИмяФайла = "TX\TX_act_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml";
	//КонецЕсли;
	//ПолноеИмяФайла = "C:\Obmen\"+ИмяФайла;	
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	//
	//ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Акты");
	
	Для Каждого стрТЧ из Товары цикл	
		
		текЗаказ = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заявка.Ссылка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Номер = &КодЗаказа";
		
		Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			текЗаказ = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		НаборЗаказ = РегистрыСведений.Заказы.СоздатьНаборЗаписей();
		НаборЗаказ.Отбор.Регистратор.Установить(текЗаказ);
		НаборЗаказ.Прочитать();
		Попытка
			текЗапись = НаборЗаказ.Получить(0);
			текЗапись.ДатаВозвратаАкта 	= ДатаВозвратаВБухгалтерию;
			текЗапись.Акт 				= Ссылка;
			НаборЗаказ.Записать();
		Исключение
		КонецПопытки;
		
		записьВзаиморасчеты = Движения.ВзаиморасчетыПоАктам.Добавить();
		записьВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		записьВзаиморасчеты.Период      = Ссылка.Дата;
		записьВзаиморасчеты.Регистратор = Ссылка;
		записьВзаиморасчеты.Организация = Ссылка.Организация;
		записьВзаиморасчеты.Контрагент	= Ссылка.Контрагент;
		записьВзаиморасчеты.КодЗаказа 	= Ссылка.Номер;
		записьВзаиморасчеты.Сумма     	= Ссылка.СуммаДокумента;
		
		Движения.Записать();			
		
		//ЗаписьXML.ЗаписатьНачалоЭлемента("Акт");	
		//
		//ЗаписьXML.ЗаписатьАтрибут("Дата",XMLСтрока(Дата));	
		//ЗаписьXML.ЗаписатьАтрибут("Номер",XMLСтрока(Номер));
		//
		//ЗаписьXML.ЗаписатьАтрибут("Контрагент",Контрагент.Наименование);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентИНН",Контрагент.ИНН);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентКПП",Контрагент.КПП);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентПолное",Контрагент.НаименованиеПолное);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентАдрес",Контрагент.ЮридическийАдрес);
		//
		//Если ЗначениеЗаполнено(Контрагент.НомерРасчетногоСчета) Тогда 
		//	ЗаписьXML.ЗаписатьАтрибут("НомерРС",Контрагент.НомерРасчетногоСчета);
		//	ЗаписьXML.ЗаписатьАтрибут("БИК",Контрагент.БИК);
		//	ЗаписьXML.ЗаписатьАтрибут("НаименованиеРС","Расчетный в "+Контрагент.Банк);
		//иначе
		//	ЗаписьXML.ЗаписатьАтрибут("НомерРС","");
		//	ЗаписьXML.ЗаписатьАтрибут("БИК","");
		//	ЗаписьXML.ЗаписатьАтрибут("НаименованиеРС","");
		//КонецЕсли;	
		//
		//ЗаписьXML.ЗаписатьАтрибут("Договор",Договор.Наименование);		
		//ЗаписьXML.ЗаписатьАтрибут("ОрганизацияИНН",Организация.ИНН);
		//ЗаписьXML.ЗаписатьАтрибут("ОрганизацияПрефикс",Организация.Префикс);
		//ЗаписьXML.ЗаписатьАтрибут("Ответственный",Отвественный.Наименование);
		//
		//ЗаписьXML.ЗаписатьАтрибут("ОснованиеНомер",Основание.Номер);
		//ЗаписьXML.ЗаписатьАтрибут("ОснованиеДата",XMLСтрока(Основание.Дата));
		//
		//ЗаписьXML.ЗаписатьАтрибут("ТоварНомерСтроки",Строка(стрТЧ.НомерСтроки));
		//ЗаписьXML.ЗаписатьАтрибут("Номенклатура",XMLСтрока(стрТЧ.Номенклатура));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварНоменклатура",стрТЧ.Номенклатура.Наименование);
		//ЗаписьXML.ЗаписатьАтрибут("ТоварКоличество",Строка(стрТЧ.Количество));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварЦена",Строка(стрТЧ.Цена));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварСумма",Строка(стрТЧ.Сумма));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварСуммаНДС",Строка(стрТЧ.СуммаНДС));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварНДС",Строка(стрТЧ.НДС));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварВсего",Строка(стрТЧ.Всего));
		//
		//Попытка
		//	ЗаписьXML.ЗаписатьАтрибут("ТоварКодЗаказа",стрТЧ.КодЗаказа.Номер);
		//Исключение
		//	ЗаписьXML.ЗаписатьАтрибут("ТоварКодЗаказа","");
		//КонецПопытки;
		//
		//ЗаписьXML.ЗаписатьКонецЭлемента();	
	КонецЦикла;
	
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.Закрыть();
	
КонецПроцедуры
